DataProcessors/лб_ОбменОмскГорГаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>лб_ОбменОмскГорГаз</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДанныеГоргаза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.лб_ДанныеГорГаза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаИзменениеУслугЛС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаИзменениеУслугПоЛС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДляСчетчиков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДляНормативаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДляНорматива2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерНорматива2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДляНорматива3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерНорматива3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНеНачислять</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКоррекцииСальдо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийРазовыеПоЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийРазовыеПоЖКХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоОтсутствующим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоЧекуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначислениеПоВременноПроживающим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначисленияПоСчетчикамГрупповое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначисленияПоСчетчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначисленияПоУслуге</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначисленияПоУслугеГрупповое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПоказанийСчетчиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедопоставкаСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедопоставкаСчетчиковГрупповое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедопоставкаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедопоставкаУслугиГрупповое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносОстатков</Name>
					<Comment>Перенос остатков между услугами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЛьгот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЛьготПоНедоставкиУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЛьготПоОтсутствующим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикамСНаличиемИндивидуальных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриСнятииСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриУстановкеСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническаяКорректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетВСвязиСИзменениемПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетПоЕдиницамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетПоЕдиницамПотребленияГрупповое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетРанееПрименяемойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначисленияПоУслугеЗаПрошлыеПериоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначисленияПоУслугеГрупповоеЗаПрошлыеПериоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетСтраховыхДобровольныхВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническаяКорректировкаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетРанееПрименяемойСтавкиЗаменаСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрупповыеПерерасчетыОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкаИзменениеУслугПоЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугиНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/лб_ОбменОмскГорГаз/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Данные из файла";
	ДиалогВыбораФайла.Фильтр    = "dBase (*.dbf)|*.dbf|";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".dbf" Тогда
			Файл = ДиалогВыбораФайла.ПолноеИмяФайла
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьDBF(ИмяФайла)
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл не существует!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	XBase  = Новый XBase;
	XBase.Кодировка = КодировкаXBase.OEM;
	Попытка
		XBase.ОткрытьФайл(ИмяФайла);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка открытия файла!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
    ОписаниеБулево = Новый ОписаниеТипов("Булево");
    ОписаниеДаты = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));

    ТаблицаЗначений = Новый ТаблицаЗначений;
    Для Каждого Поле из XBase.Поля Цикл
        Если Поле.Тип = "L" Тогда
            Тип = ОписаниеБулево;
        ИначеЕсли Поле.Тип = "D" Тогда
            Тип = ОписаниеДаты;
        ИначеЕсли (Поле.Тип = "N") ИЛИ (Поле.Тип = "F") Тогда
            Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Поле.Длина, Поле.Точность));
        Иначе
            Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(Поле.Длина));
        КонецЕсли;
        ТаблицаЗначений.Колонки.Добавить(Поле.Имя, Тип);
    КонецЦикла;
	
	//Проверка файла
	РезультатПроверки = ПроверитьDBF(ТаблицаЗначений.Колонки);
	Если Не РезультатПроверки Тогда
		ТекстСообщения = НСтр("ru = 'Структура файла не соотвествует требованиям!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	
    Если (ТаблицаЗначений.Колонки.Количество() <> 0) И (XBase.Первая()) Тогда
        Пока Истина Цикл
            СтрокаТаб = ТаблицаЗначений.Добавить();
            Для Каждого Поле из XBase.Поля Цикл
                СтрокаТаб[Поле.Имя] = СокрЛП(XBase[Поле.Имя]);
            КонецЦикла;
			Если Не XBase.Следующая() Тогда 
				Прервать; 
			КонецЕсли;
        КонецЦикла;
    КонецЕсли;
	
    XBase.ЗакрытьФайл();
	
	ВременноеХранилищеDBFФайл = ПоместитьВоВременноеХранилище(ТаблицаЗначений, Новый УникальныйИдентификатор());	
	
    Возврат Истина
		
КонецФункции

&НаСервере
Функция ПроверитьDBF(Колонки)
	
	Массив = Новый Массив;
	Массив.Добавить("LIC");
	Массив.Добавить("TARIF");
	Массив.Добавить("NORM");
	Массив.Добавить("SAL_K");
	Массив.Добавить("S_PENI");
	Массив.Добавить("PENI");
	Массив.Добавить("CH");
	Массив.Добавить("N_SCHET");
	Массив.Добавить("D_POV");
	Массив.Добавить("N_POK");
	
	Для Каждого Колонка из Массив Цикл
		
		Поиск = Колонки.Найти(Колонка);
		
		Если Поиск = Неопределено Тогда
			Возврат Ложь
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;     
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПолеДокументДанныеГорГаза(Коррекция = Ложь)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_ДанныеГорГаза.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.лб_ДанныеГорГаза КАК лб_ДанныеГорГаза
	               |ГДЕ
	               |	лб_ДанныеГорГаза.Дата Между &ДатаН И &ДатаК
	               |	И НЕ лб_ДанныеГорГаза.ПометкаУдаления
	               |	И лб_ДанныеГорГаза.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(КонецМесяца(Объект.Период)));
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(НачалоМесяца(Объект.Период)));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Если Не Коррекция Тогда
			Объект.ДокументДанныеГоргаза = СоздатьПустойДокументДанныеГорГаза()
		Иначе
			ТекстСообщения = НСтр("ru = 'Данные ГорГаза за выбранный период не были загружены!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат
		КонецЕсли;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Объект.ДокументДанныеГоргаза = Выборка.Ссылка;
		ОбъектДокумент = Объект.ДокументДанныеГоргаза.Ссылка.ПолучитьОбъект();
		ОбъектДокумент.Дата = КонецДня(КонецМесяца(Объект.Период));
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументДанныеГоргаза.ДокументКоррекцииСальдо) и Не Коррекция Тогда
		ОбъектДокумент = Объект.ДокументДанныеГоргаза.Ссылка.ПолучитьОбъект();
		ОбъектДокумент.ДокументКоррекцииСальдо = СоздатьПустойДокументКоррекцииСальдо();
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументДанныеГоргаза.УстановкаИзменениеУслугЛС) и Не Коррекция Тогда
		ОбъектДокумент = Объект.ДокументДанныеГоргаза.Ссылка.ПолучитьОбъект();
		ОбъектДокумент.УстановкаИзменениеУслугЛС = СоздатьПустойДокументУстановкаИзменениеУслугПоЛС();
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Объект.УстановкаИзменениеУслугЛС = Объект.ДокументДанныеГоргаза.УстановкаИзменениеУслугЛС;
	Объект.ДокументКоррекцииСальдо = Объект.ДокументДанныеГоргаза.ДокументКоррекцииСальдо;
	
КонецПроцедуры

Функция СоздатьПустойДокументДанныеГорГаза()

	Документ = Документы.лб_ДанныеГорГаза.СоздатьДокумент();
	Документ.Дата = КонецДня(КонецМесяца(Объект.Период));
	Документ.Организация = Объект.Организация;
	Документ.Услуга = Объект.Услуга;
	Документ.Поставщик = Объект.Поставщик;
	Документ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Документ.Ссылка;

КонецФункции // СоздатьПустойДокументДанныеГорГаза()

Функция СоздатьПустойДокументКоррекцииСальдо()

	Документ = Документы.бит_РазовыеПоУслугамЖКХ.СоздатьДокумент();
	Документ.Дата = КонецДня(КонецМесяца(Объект.Период));
	Документ.Организация = Объект.Организация;
	Документ.ВидОперации = Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ДоначисленияПоУслугеГрупповое;
	Документ.Комментарий = "Коррекция изменений по данным горгаза!";
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Документ.Ссылка;

КонецФункции // СоздатьПустойДокументКоррекцииСальдо()

Функция СоздатьПустойДокументУстановкаИзменениеУслугПоЛС()

	Документ = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
	Документ.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;
	Документ.Дата = НачалоДня(НачалоМесяца(Объект.Период));
	Документ.Услуга = Объект.Услуга;
	Документ.Комментарий = "Коррекция изменений по данным горгаза!";
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Документ.Ссылка;

КонецФункции // СоздатьПустойДокументУстановкаИзменениеУслугПоЛС()

Процедура ЗаполнитьДокументУстановкаИзменениеУслугПоЛС()
	
	Если Не ЗначениеЗаполнено(Объект.УстановкаИзменениеУслугЛС) ИЛИ Не ЗначениеЗаполнено(Объект.Услуга) ИЛИ
		Не ЗначениеЗаполнено(Объект.ДокументДанныеГоргаза) ИЛИ Объект.ДокументДанныеГоргаза.ТЧ = 0 ИЛИ
		Не ЗначениеЗаполнено(Объект.Поставщик) Тогда
		Возврат
	КонецЕсли;
	
	ТЗизТЧ = Объект.ДокументДанныеГоргаза.ТЧ.Выгрузить();
	ДокументОбъект = Объект.УстановкаИзменениеУслугЛС.ПолучитьОбъект();
	ДокументОбъект.ЛицевыеСчета.Очистить();

		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЧ", ТЗизТЧ);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.УстановитьПараметр("Поставщик", Объект.Поставщик);
	Запрос.УстановитьПараметр("СпособРасчета", Перечисления.бит_СпособыРасчетаПоУслугам.ПоЕдиницамПотребления);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоМесяца(Объект.Период)));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	               |	ТЧ.ЛицевойСчет КАК ЛицевойСчет,
	               |	ТЧ.Режим КАК РежимПотребления
	               |ПОМЕСТИТЬ ДанныеГорГаз
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеГорГаз.ЛицевойСчет КАК ЛицевойСчет_ГГ,
	               |	&Услуга КАК Услуга_ГГ,
	               |	&Поставщик КАК Поставщик_ГГ,
	               |	&СпособРасчета КАК СпособРасчета_ГГ,
	               |	ДанныеГорГаз.РежимПотребления КАК РежимПотребления_ГГ,
	               |	ДанныеГорГаз.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления_ГГ
	               |ПОМЕСТИТЬ ДанныеГорГаз2
	               |ИЗ
	               |	ДанныеГорГаз КАК ДанныеГорГаз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления_БД,
	               |	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления_БД
	               |ПОМЕСТИТЬ ДанныеРегистр
	               |ИЗ
	               |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&НачалоПериода, Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеГорГаз2.ЛицевойСчет_ГГ КАК ЛицевойСчет_ГГ,
	               |	ДанныеГорГаз2.Услуга_ГГ КАК Услуга_ГГ,
	               |	ДанныеГорГаз2.СпособРасчета_ГГ КАК СпособРасчета_ГГ,
	               |	ВЫБОР
	               |		КОГДА ДанныеГорГаз2.Поставщик_ГГ <> ДанныеРегистр.Поставщик_БД
	               |				ИЛИ ДанныеГорГаз2.КоличествоЕдиницПотребления_ГГ <> ДанныеРегистр.КоличествоЕдиницПотребления_БД
	               |				ИЛИ ДанныеГорГаз2.РежимПотребления_ГГ <> ДанныеРегистр.РежимПотребления_БД
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Изменен,
	               |	ДанныеГорГаз2.Поставщик_ГГ КАК Поставщик_ГГ,
	               |	ДанныеГорГаз2.РежимПотребления_ГГ КАК РежимПотребления_ГГ,
	               |	ДанныеГорГаз2.КоличествоЕдиницПотребления_ГГ КАК КоличествоЕдиницПотребления_ГГ
	               |ПОМЕСТИТЬ Финиш
	               |ИЗ
	               |	ДанныеГорГаз2 КАК ДанныеГорГаз2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистр КАК ДанныеРегистр
	               |		ПО ДанныеГорГаз2.ЛицевойСчет_ГГ = ДанныеРегистр.ЛицевойСчет_БД
	               |			И ДанныеГорГаз2.Услуга_ГГ = ДанныеРегистр.Услуга_БД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Финиш.ЛицевойСчет_ГГ КАК ЛицевойСчет,
	               |	Финиш.Услуга_ГГ КАК Услуга,
	               |	Финиш.СпособРасчета_ГГ КАК СпособРасчета,
	               |	Финиш.Поставщик_ГГ КАК Поставщик,
	               |	Финиш.РежимПотребления_ГГ КАК РежимПотребления,
	               |	Финиш.КоличествоЕдиницПотребления_ГГ КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	Финиш КАК Финиш
	               |ГДЕ
	               |	Финиш.Изменен";
	
	
	ДокументОбъект.ЛицевыеСчета.Загрузить(Запрос.Выполнить().Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ЗагрузитьФайлНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Услуга");
	Массив.Добавить("Поставщик");
	Массив.Добавить("Организация");
	Массив.Добавить("РежимДляСчетчиков");
	Массив.Добавить("РежимДляНормативаПоУмолчанию");
	Массив.Добавить("РежимДляНорматива2");
	Массив.Добавить("РазмерНорматива2");
	Массив.Добавить("РежимДляНорматива3");
	Массив.Добавить("РазмерНорматива3");
	Массив.Добавить("РежимНеНачислять");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//Возврат
		КонецЕсли;
	КонецЦикла;
	
	РезультатРаботы = ПрочитатьDBF(Файл);
	
	ТаблицаЗначений = Неопределено;
	
	Если РезультатРаботы Тогда
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(ВременноеХранилищеDBFФайл);
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаЗначений) <> Тип("ТаблицаЗначений") Тогда
		Возврат
	КонецЕсли;
	
	Запрос = ДополнитьДанныеГорГаза(ТаблицаЗначений);
	
	ЗаполнитьПолеДокументДанныеГорГаза();
	
	ДокументДанныеГорГаз = Объект.ДокументДанныеГоргаза.ПолучитьОбъект();
	ДокументДанныеГорГаз.ТЧ.Загрузить(Запрос[9].Выгрузить());
	ДокументДанныеГорГаз.Записать(РежимЗаписиДокумента.Запись);
	
	ЗаполнитьДокументУстановкаИзменениеУслугПоЛС();
	
	ВывестиНеНайденныеЛС(Запрос[8].Выгрузить());
	
КонецПроцедуры

Процедура ВывестиНеНайденныеЛС(ТаблицаЗначений)
	
	Если ТаблицаЗначений.Количество() = 0 Тогда
		Возврат
	Иначе
		Для Каждого Строка Из ТаблицаЗначений Цикл
			ТекстСообщения = НСтр("ru = 'Не найден лицевой счет - %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.LIC);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ДополнитьДанныеГорГаза(ТаблицаЗначений)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СтатусПроживания,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВладелецКвартиры,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроживаниеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_1
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ПроживающиеПоЛССрезПоследних
	               |		ПО бит_ЛицевыеСчета.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(бит_ПроживающиеПоЛС_1.СтатусПроживания) КАК ЧислаПроживающих,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ВладелецКвартиры) КАК Владелецы,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ПроживаниеВДанныйМомент) КАК ПроживанющиеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_2
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_1 КАК бит_ПроживающиеПоЛС_1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_2.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих > бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих < бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = 0
	               |				И бит_ПроживающиеПоЛС_2.Владелецы = 0
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ПроживанющиеВДанныйМомент
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЧислоЕдиницПотребления
	               |ПОМЕСТИТЬ ПроживающиеПоЛС
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_2 КАК бит_ПроживающиеПоЛС_2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеИзФайла.LIC КАК LIC,
	               |	ДанныеИзФайла.TARIF КАК TARIF,
	               |	ДанныеИзФайла.NORM КАК NORM,
	               |	ДанныеИзФайла.SAL_K КАК SAL_K,
	               |	ДанныеИзФайла.S_PENI КАК S_PENI,
	               |	ДанныеИзФайла.PENI КАК PENI,
	               |	ДанныеИзФайла.CH КАК CH,
	               |	ДанныеИзФайла.N_SCHET КАК N_SCHET,
	               |	ДанныеИзФайла.D_POV КАК D_POV,
	               |	ДанныеИзФайла.N_POK КАК N_POK
	               |ПОМЕСТИТЬ ДанныеИзФайла
	               |ИЗ
	               |	&ДанныеИзФайла КАК ДанныеИзФайла
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеИзФайла.LIC КАК LIC,
	               |	ДанныеИзФайла.TARIF КАК TARIF,
	               |	ДанныеИзФайла.NORM КАК NORM,
	               |	ДанныеИзФайла.SAL_K КАК SAL_K,
	               |	ДанныеИзФайла.CH КАК CH,
	               |	ДанныеИзФайла.N_SCHET КАК N_SCHET,
	               |	ДанныеИзФайла.D_POV КАК D_POV,
	               |	ДанныеИзФайла.N_POK КАК N_POK,
	               |	ВЫБОР
	               |		КОГДА ДанныеИзФайла.TARIF = 0
	               |			ТОГДА &РежимНеНачислять
	               |		КОГДА ДанныеИзФайла.CH = 1
	               |			ТОГДА &РежимПоСчетчикамГорГаз
	               |		КОГДА ДанныеИзФайла.CH = 0
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ПроверятьРежим2
	               |							И ДанныеИзФайла.NORM = &РазмерРежим2
	               |						ТОГДА &РежимПоНормамГорГаз2
	               |					КОГДА &ПроверятьРежим3
	               |							И ДанныеИзФайла.NORM = &РазмерРежим3
	               |						ТОГДА &РежимПоНормамГорГаз3
	               |					ИНАЧЕ &РежимПоНормамГорГаз
	               |				КОНЕЦ
	               |	КОНЕЦ КАК РежимПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеИзФайла.CH = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НаличиеСчетчика
	               |ПОМЕСТИТЬ ДанныеИзФайла2
	               |ИЗ
	               |	ДанныеИзФайла КАК ДанныеИзФайла
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	               |	бит_ЛицевыеСчета.Наименование КАК Наименование
	               |ПОМЕСТИТЬ ВсеЛС
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеЛС.Ссылка.Здание КАК Здание,
	               |	ВсеЛС.Ссылка КАК ЛицевойСчет,
	               |	ДанныеИзФайла2.TARIF КАК Тариф,
	               |	ДанныеИзФайла2.NORM КАК Норматив,
	               |	ДанныеИзФайла2.SAL_K КАК Сальдо,
	               |	ДанныеИзФайла2.НаличиеСчетчика КАК НаличиеСчетчика,
	               |	ДанныеИзФайла2.N_SCHET КАК НомерСчетчика,
	               |	ДанныеИзФайла2.D_POV КАК ДатаПоверки,
	               |	ДанныеИзФайла2.N_POK КАК ТекПоказание,
	               |	ДанныеИзФайла2.РежимПотребления КАК Режим,
	               |	ДанныеИзФайла2.LIC КАК LIC
	               |ПОМЕСТИТЬ ДанныеИзФайла3
	               |ИЗ
	               |	ДанныеИзФайла2 КАК ДанныеИзФайла2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЛС КАК ВсеЛС
	               |		ПО ДанныеИзФайла2.LIC = ВсеЛС.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеИзФайла3.Здание КАК Здание,
	               |	ДанныеИзФайла3.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеИзФайла3.Тариф КАК Тариф,
	               |	ДанныеИзФайла3.Норматив КАК Норматив,
	               |	ДанныеИзФайла3.Сальдо КАК Сальдо,
	               |	ДанныеИзФайла3.НаличиеСчетчика КАК НаличиеСчетчика,
	               |	ДанныеИзФайла3.НомерСчетчика КАК НомерСчетчика,
	               |	ДанныеИзФайла3.ДатаПоверки КАК ДатаПоверки,
	               |	ДанныеИзФайла3.ТекПоказание КАК ТекПоказание,
	               |	ДанныеИзФайла3.Режим КАК Режим,
	               |	ПроживающиеПоЛС.ЧислоЕдиницПотребления КАК ЧислоЕдиницПотребления,
	               |	ДанныеИзФайла3.LIC КАК LIC
	               |ПОМЕСТИТЬ ФинишДляФильтра
	               |ИЗ
	               |	ДанныеИзФайла3 КАК ДанныеИзФайла3
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеПоЛС КАК ПроживающиеПоЛС
	               |		ПО ДанныеИзФайла3.ЛицевойСчет = ПроживающиеПоЛС.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФинишДляФильтра.LIC КАК LIC
	               |ИЗ
	               |	ФинишДляФильтра КАК ФинишДляФильтра
	               |ГДЕ
	               |	ФинишДляФильтра.ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФинишДляФильтра.Здание КАК Здание,
	               |	ФинишДляФильтра.ЛицевойСчет КАК ЛицевойСчет,
	               |	ФинишДляФильтра.Тариф КАК Тариф,
	               |	ФинишДляФильтра.Норматив КАК Норматив,
	               |	ФинишДляФильтра.Сальдо КАК Сальдо,
	               |	ФинишДляФильтра.НаличиеСчетчика КАК НаличиеСчетчика,
	               |	ФинишДляФильтра.НомерСчетчика КАК НомерСчетчика,
	               |	ФинишДляФильтра.ДатаПоверки КАК ДатаПоверки,
	               |	ФинишДляФильтра.ТекПоказание КАК ТекПоказание,
	               |	ФинишДляФильтра.Режим КАК Режим,
	               |	ФинишДляФильтра.ЧислоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	ФинишДляФильтра КАК ФинишДляФильтра
	               |ГДЕ
	               |	ФинишДляФильтра.ЛицевойСчет <> ЗНАЧЕНИЕ(Справочник.бит_ЛицевыеСчета.ПустаяСсылка)";
				   
	Запрос.УстановитьПараметр("ДанныеИзФайла", ТаблицаЗначений);
	Запрос.УстановитьПараметр("РежимНеНачислять", Объект.РежимНеНачислять);
	Запрос.УстановитьПараметр("РазмерРежим2", Объект.РазмерНорматива2);
	Запрос.УстановитьПараметр("РазмерРежим3", Объект.РазмерНорматива3);
	Запрос.УстановитьПараметр("РежимПоНормамГорГаз2", Объект.РежимДляНорматива2);
	Запрос.УстановитьПараметр("РежимПоНормамГорГаз3", Объект.РежимДляНорматива3);
	Запрос.УстановитьПараметр("РежимПоСчетчикамГорГаз", Объект.РежимДляСчетчиков);
	Запрос.УстановитьПараметр("РежимПоНормамГорГаз", Объект.РежимДляНормативаПоУмолчанию);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецМесяца(Объект.Период)));
	
	Если ЗначениеЗаполнено(Объект.РежимДляНорматива2) И Объект.РазмерНорматива2 <> 0 Тогда
		Запрос.УстановитьПараметр("ПроверятьРежим2", Истина);
	Иначе
		Запрос.УстановитьПараметр("ПроверятьРежим2", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РежимДляНорматива3) И Объект.РазмерНорматива3 <> 0 Тогда
		Запрос.УстановитьПараметр("ПроверятьРежим3", Истина);
	Иначе
		Запрос.УстановитьПараметр("ПроверятьРежим3", Ложь);
	КонецЕсли;

	Возврат Запрос.ВыполнитьПакет(); 	

КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()
	
	Массив = Новый Массив;
	Массив.Добавить("Период");
	Массив.Добавить("Услуга");
	Массив.Добавить("Поставщик");
	Массив.Добавить("Организация");
	Массив.Добавить("РежимДляСчетчиков");
	Массив.Добавить("РежимДляНормативаПоУмолчанию");
	Массив.Добавить("РежимДляНорматива2");
	Массив.Добавить("РазмерНорматива2");
	Массив.Добавить("РежимДляНорматива3");
	Массив.Добавить("РазмерНорматива3");
	Массив.Добавить("РежимНеНачислять");
	
	Для Каждого Реквизит ИЗ Массив Цикл
		Если Не ЗначениеЗаполнено(Объект[Реквизит]) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит %1!'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Реквизит);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//Возврат
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПолеДокументДанныеГорГаза();
	
	Если Не ЗначениеЗаполнено(Объект.УстановкаИзменениеУслугЛС) Тогда
		Возврат
	КонецЕсли;
	
	ДокументОбъект = Объект.УстановкаИзменениеУслугЛС.ПолучитьОбъект();
	ДокументОбъект.ЛицевыеСчета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РежимПотребления", Объект.РежимДляНормативаПоУмолчанию);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СтатусПроживания,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВладелецКвартиры,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроживаниеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_1
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ) КАК бит_ПроживающиеПоЛССрезПоследних
	               |		ПО бит_ЛицевыеСчета.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(бит_ПроживающиеПоЛС_1.СтатусПроживания) КАК ЧислаПроживающих,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ВладелецКвартиры) КАК Владелецы,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ПроживаниеВДанныйМомент) КАК ПроживанющиеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_2
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_1 КАК бит_ПроживающиеПоЛС_1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_2.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих > бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих < бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = 0
	               |				И бит_ПроживающиеПоЛС_2.Владелецы = 0
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ПроживанющиеВДанныйМомент
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЧислоЕдиницПотребления
	               |ПОМЕСТИТЬ ПроживающиеПоЛС
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_2 КАК бит_ПроживающиеПоЛС_2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	               |	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	               |	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	               |	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	               |	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ПОМЕСТИТЬ ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	               |			,
	               |			РежимПотребления = &РежимПотребления
	               |				И Услуга = &Услуга) КАК бит_СведенияПоУслугамЛССрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеРегистра.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеРегистра.Услуга КАК Услуга,
	               |	ДанныеРегистра.Поставщик КАК Поставщик,
	               |	ДанныеРегистра.СпособРасчета КАК СпособРасчета,
	               |	ДанныеРегистра.РежимПотребления КАК РежимПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеРегистра.КоличествоЕдиницПотребления <> ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |			ТОГДА ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |		ИНАЧЕ ДанныеРегистра.КоличествоЕдиницПотребления
	               |	КОНЕЦ КАК КоличествоЕдиницПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеРегистра.КоличествоЕдиницПотребления <> ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Изменен
	               |ПОМЕСТИТЬ Финиш
	               |ИЗ
	               |	ДанныеРегистра КАК ДанныеРегистра
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеПоЛС КАК ПроживающиеПоЛС
	               |		ПО ДанныеРегистра.ЛицевойСчет = ПроживающиеПоЛС.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Финиш.ЛицевойСчет КАК ЛицевойСчет,
	               |	Финиш.Услуга КАК Услуга,
	               |	Финиш.Поставщик КАК Поставщик,
	               |	Финиш.СпособРасчета КАК СпособРасчета,
	               |	Финиш.РежимПотребления КАК РежимПотребления,
	               |	Финиш.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	Финиш КАК Финиш
	               |ГДЕ
	               |	Финиш.Изменен";
	
	ДокументОбъект.ЛицевыеСчета.Загрузить(Запрос.Выполнить().Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ТекстСообщения = НСтр("ru = 'Обновление успешно произведено!'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период = ТекущаяДата();
	Объект.Организация = Справочники.Организации.НайтиПоНаименованию("Наша организация");
	Объект.Поставщик = Справочники.бит_ПоставщикиУслуг.НайтиПоНаименованию("ГорГаз");
	Объект.Услуга = Справочники.бит_УслугиЖКХ.НайтиПоНаименованию("ГорГаз");
	Объект.РежимНеНачислять = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Не начислять");
	Объект.РежимДляСчетчиков = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("По счетчикам (Горгаз)");
	Объект.РежимДляНормативаПоУмолчанию = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("По нормативам (ГорГаз)");
	Объект.РежимДляНорматива2 = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Режим номер 2");
	Объект.РежимДляНорматива3 = Справочники.бит_РежимыПотребленияУслуг.НайтиПоНаименованию("Режим номер 3");
	Объект.РазмерНорматива2 = 5;
	Объект.РазмерНорматива3 = 6;
КонецПроцедуры

Функция Служебная()

		//Текст запрос "ОбновитьНаСервере" на 11.12.18
		Текст = "ВЫБРАТЬ
	               |	ГорГаз.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	               |	ГорГаз.ЛицевойСчет КАК ЛицевойСчет,
	               |	ГорГаз.Режим КАК РежимПотребления
	               |ПОМЕСТИТЬ ДанныеГорГаз_1
	               |ИЗ
	               |	&ГорГаз КАК ГорГаз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеГорГаз.ЛицевойСчет КАК ЛицевойСчет,
	               |	&Услуга КАК Услуга,
	               |	&Поставщик КАК Поставщик,
	               |	&СпособРасчета КАК СпособРасчета,
	               |	ДанныеГорГаз.РежимПотребления КАК РежимПотребления,
	               |	ДанныеГорГаз.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	               |ПОМЕСТИТЬ ДанныеГорГаз_2
	               |ИЗ
	               |	ДанныеГорГаз_1 КАК ДанныеГорГаз
	               |ГДЕ
	               |	ДанныеГорГаз.РежимПотребления = &РежимПоНормамГорГаз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЛС.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	               |	ДанныеЛС.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеЛС.Поставщик КАК Поставщик,
	               |	ДанныеЛС.РежимПотребления КАК РежимПотребления,
	               |	ДанныеЛС.СпособРасчета КАК СпособРасчета,
	               |	ДанныеЛС.Услуга КАК Услуга
	               |ПОМЕСТИТЬ ДанныеЛС_1
	               |ИЗ
	               |	&ДанныеЛС КАК ДанныеЛС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания = ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СтатусПроживания,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВладелецКвартиры,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроживаниеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_1
	               |ИЗ
	               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ) КАК бит_ПроживающиеПоЛССрезПоследних
	               |		ПО бит_ЛицевыеСчета.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(бит_ПроживающиеПоЛС_1.СтатусПроживания) КАК ЧислаПроживающих,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ВладелецКвартиры) КАК Владелецы,
	               |	СУММА(бит_ПроживающиеПоЛС_1.ПроживаниеВДанныйМомент) КАК ПроживанющиеВДанныйМомент
	               |ПОМЕСТИТЬ бит_ПроживающиеПоЛС_2
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_1 КАК бит_ПроживающиеПоЛС_1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_ПроживающиеПоЛС_1.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛС_2.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих > бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих < бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = бит_ПроживающиеПоЛС_2.Владелецы
	               |			ТОГДА бит_ПроживающиеПоЛС_2.Владелецы
	               |		КОГДА бит_ПроживающиеПоЛС_2.ЧислаПроживающих = 0
	               |				И бит_ПроживающиеПоЛС_2.Владелецы = 0
	               |			ТОГДА бит_ПроживающиеПоЛС_2.ПроживанющиеВДанныйМомент
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЧислоЕдиницПотребления
	               |ПОМЕСТИТЬ ПроживающиеПоЛС
	               |ИЗ
	               |	бит_ПроживающиеПоЛС_2 КАК бит_ПроживающиеПоЛС_2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЛС_1.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеЛС_1.Поставщик КАК Поставщик,
	               |	ДанныеЛС_1.РежимПотребления КАК РежимПотребления,
	               |	ДанныеЛС_1.СпособРасчета КАК СпособРасчета,
	               |	ДанныеЛС_1.Услуга КАК Услуга,
	               |	ВЫБОР
	               |		КОГДА ДанныеЛС_1.РежимПотребления = &РежимПоНормамГорГаз
	               |			ТОГДА ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |		ИНАЧЕ ДанныеЛС_1.КоличествоЕдиницПотребления
	               |	КОНЕЦ КАК КоличествоЕдиницПотребления,
	               |	ИСТИНА КАК ЛС
	               |ПОМЕСТИТЬ ФинишЛС
	               |ИЗ
	               |	ДанныеЛС_1 КАК ДанныеЛС_1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеПоЛС КАК ПроживающиеПоЛС
	               |		ПО ДанныеЛС_1.ЛицевойСчет = ПроживающиеПоЛС.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеГорГаз_2.ЛицевойСчет КАК ЛицевойСчет,
	               |	ДанныеГорГаз_2.Услуга КАК Услуга,
	               |	ДанныеГорГаз_2.Поставщик КАК Поставщик,
	               |	ДанныеГорГаз_2.СпособРасчета КАК СпособРасчета,
	               |	ДанныеГорГаз_2.РежимПотребления КАК РежимПотребления,
	               |	ВЫБОР
	               |		КОГДА ДанныеГорГаз_2.КоличествоЕдиницПотребления <> ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |			ТОГДА ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |		ИНАЧЕ ДанныеГорГаз_2.КоличествоЕдиницПотребления
	               |	КОНЕЦ КАК КоличествоЕдиницПотребления,
	               |	ИСТИНА КАК ГорГаз
	               |ПОМЕСТИТЬ ФинишГорГаз
	               |ИЗ
	               |	ДанныеГорГаз_2 КАК ДанныеГорГаз_2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроживающиеПоЛС КАК ПроживающиеПоЛС
	               |		ПО ДанныеГорГаз_2.ЛицевойСчет = ПроживающиеПоЛС.ЛицевойСчет
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ДанныеГорГаз_2.КоличествоЕдиницПотребления <> ПроживающиеПоЛС.ЧислоЕдиницПотребления
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ФинишГорГаз.ГорГаз = ИСТИНА
	               |			ТОГДА ФинишГорГаз.ЛицевойСчет
	               |		ИНАЧЕ ФинишЛС.ЛицевойСчет
	               |	КОНЕЦ КАК ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА ФинишГорГаз.ГорГаз = ИСТИНА
	               |			ТОГДА ФинишГорГаз.Услуга
	               |		ИНАЧЕ ФинишЛС.Услуга
	               |	КОНЕЦ КАК Услуга,
	               |	ВЫБОР
	               |		КОГДА ФинишГорГаз.ГорГаз = ИСТИНА
	               |			ТОГДА ФинишГорГаз.Поставщик
	               |		ИНАЧЕ ФинишЛС.Поставщик
	               |	КОНЕЦ КАК Поставщик,
	               |	ВЫБОР
	               |		КОГДА ФинишГорГаз.ГорГаз = ИСТИНА
	               |			ТОГДА ФинишГорГаз.СпособРасчета
	               |		ИНАЧЕ ФинишЛС.СпособРасчета
	               |	КОНЕЦ КАК СпособРасчета,
	               |	ВЫБОР
	               |		КОГДА ФинишГорГаз.ГорГаз = ИСТИНА
	               |			ТОГДА ФинишГорГаз.РежимПотребления
	               |		ИНАЧЕ ФинишЛС.РежимПотребления
	               |	КОНЕЦ КАК РежимПотребления,
	               |	ВЫБОР
	               |		КОГДА ФинишГорГаз.ГорГаз = ИСТИНА
	               |			ТОГДА ФинишГорГаз.КоличествоЕдиницПотребления
	               |		ИНАЧЕ ФинишЛС.КоличествоЕдиницПотребления
	               |	КОНЕЦ КАК КоличествоЕдиницПотребления
	               |ИЗ
	               |	ФинишГорГаз КАК ФинишГорГаз
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ФинишЛС КАК ФинишЛС
	               |		ПО ФинишГорГаз.ЛицевойСчет = ФинишЛС.ЛицевойСчет";


КонецФункции // Служебная()

&НаСервере
Процедура КоррекцияСальдоНаСервере()
	
	ЗаполнитьПолеДокументДанныеГорГаза(Истина);
	Результат = "";
	лб_ГорГаз.КоррекцияСальдоГорГаз(Объект.Период, Объект.Организация, Результат);
	
	ТекстСообщения = НСтр("ru = '%1!'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Результат);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 	
	
КонецПроцедуры

&НаКлиенте
Процедура КоррекцияСальдо(Команда)
	КоррекцияСальдоНаСервере();
КонецПроцедуры
